const ALL_TEACHERS = [
    {
        "name": "井上　千鶴子",
        "dept": "一般（文系）"
    },
    {
        "name": "小川　清次",
        "dept": "一般（文系）"
    },
    {
        "name": "川村　珠巨",
        "dept": "一般（文系）"
    },
    {
        "name": "西野　達雄",
        "dept": "一般（文系）"
    },
    {
        "name": "坂井　二三絵",
        "dept": "一般（文系）"
    },
    {
        "name": "中山　良子",
        "dept": "一般（文系）"
    },
    {
        "name": "川光　大介",
        "dept": "一般（文系）"
    },
    {
        "name": "谷野　圭亮",
        "dept": "一般（文系）"
    },
    {
        "name": "松井　悠香",
        "dept": "一般（文系）"
    },
    {
        "name": "北野　健一",
        "dept": "一般（理系）"
    },
    {
        "name": "佐藤　修",
        "dept": "一般（理系）"
    },
    {
        "name": "中田　裕一",
        "dept": "一般（理系）"
    },
    {
        "name": "楢崎　亮",
        "dept": "一般（理系）"
    },
    {
        "name": "橋爪　裕",
        "dept": "一般（理系）"
    },
    {
        "name": "稗田　吉成",
        "dept": "一般（理系）"
    },
    {
        "name": "松野　高典",
        "dept": "一般（理系）"
    },
    {
        "name": "鬼頭　秀行",
        "dept": "一般（理系）"
    },
    {
        "name": "室谷　文祥",
        "dept": "一般（理系）"
    },
    {
        "name": "梶　真理香",
        "dept": "一般（理系）"
    },
    {
        "name": "金井　友希美",
        "dept": "一般（理系）"
    },
    {
        "name": "松永　博昭",
        "dept": "一般（理系）"
    },
    {
        "name": "西田　博一",
        "dept": "一般（理系）"
    },
    {
        "name": "石川　寿敏 (M)",
        "dept": "エネルギー機械"
    },
    {
        "name": "君家　直之 (M)",
        "dept": "エネルギー機械"
    },
    {
        "name": "上村　匡敬 (M)",
        "dept": "エネルギー機械"
    },
    {
        "name": "久野　章仁 (A)",
        "dept": "エネルギー機械"
    },
    {
        "name": "杉浦　公彦 (M)",
        "dept": "エネルギー機械"
    },
    {
        "name": "塚本　晃久 (M)",
        "dept": "エネルギー機械"
    },
    {
        "name": "西岡　求 (A)",
        "dept": "エネルギー機械"
    },
    {
        "name": "平林　大介 (A)",
        "dept": "エネルギー機械"
    },
    {
        "name": "中津　壮人 (M)",
        "dept": "エネルギー機械"
    },
    {
        "name": "白柳　博章 (C)",
        "dept": "エネルギー機械"
    },
    {
        "name": "鯵坂　誠之 (C)",
        "dept": "プロダクトデザイン"
    },
    {
        "name": "岩本　いづみ (C)",
        "dept": "プロダクトデザイン"
    },
    {
        "name": "里中　直樹 (H)",
        "dept": "プロダクトデザイン"
    },
    {
        "name": "中谷　敬子 (H)",
        "dept": "プロダクトデザイン"
    },
    {
        "name": "難波　邦彦 (M)",
        "dept": "プロダクトデザイン"
    },
    {
        "name": "藪　厚生 (H)",
        "dept": "プロダクトデザイン"
    },
    {
        "name": "倉橋　健介 (A)",
        "dept": "プロダクトデザイン"
    },
    {
        "name": "古田　和久 (M)",
        "dept": "プロダクトデザイン"
    },
    {
        "name": "勇　地有理 (M)",
        "dept": "プロダクトデザイン"
    },
    {
        "name": "前田　一成 (H)",
        "dept": "プロダクトデザイン"
    },
    {
        "name": "梅本　敏孝 (E)",
        "dept": "エレクトロニクス"
    },
    {
        "name": "金田　忠裕 (H)",
        "dept": "エレクトロニクス"
    },
    {
        "name": "重井　宣行 (E)",
        "dept": "エレクトロニクス"
    },
    {
        "name": "辻元　英孝 (A)",
        "dept": "エレクトロニクス"
    },
    {
        "name": "東田　卓 (A)",
        "dept": "エレクトロニクス"
    },
    {
        "name": "前田　篤志 (E)",
        "dept": "エレクトロニクス"
    },
    {
        "name": "川上　太知 (E)",
        "dept": "エレクトロニクス"
    },
    {
        "name": "田村　生弥 (C)",
        "dept": "エレクトロニクス"
    },
    {
        "name": "野田　達夫 (A)",
        "dept": "エレクトロニクス"
    },
    {
        "name": "安藤　太一 (H)",
        "dept": "エレクトロニクス"
    },
    {
        "name": "榎倉　浩志 (E)",
        "dept": "エレクトロニクス"
    },
    {
        "name": "青木　一弘 (E)",
        "dept": "知能情報"
    },
    {
        "name": "窪田　哲也 (E)",
        "dept": "知能情報"
    },
    {
        "name": "土井　智晴 (H)",
        "dept": "知能情報"
    },
    {
        "name": "新妻　弘崇 (E)",
        "dept": "知能情報"
    },
    {
        "name": "早川　潔 (E)",
        "dept": "知能情報"
    },
    {
        "name": "山野　高志 (C)",
        "dept": "知能情報"
    },
    {
        "name": "和田　健 (H)",
        "dept": "知能情報"
    },
    {
        "name": "中才　恵太朗 (E)",
        "dept": "知能情報"
    },
    {
        "name": "吉田　晃基 (E)",
        "dept": "知能情報"
    },
    {
        "name": "木村　祐太 (E)",
        "dept": "知能情報"
    },
    {
        "name": "高橋　舞",
        "dept": "保健室"
    },
    {
        "name": "有末　宏明",
        "dept": "非常勤講師"
    },
    {
        "name": "上田　純子",
        "dept": "非常勤講師"
    },
    {
        "name": "打田　剛生",
        "dept": "非常勤講師"
    },
    {
        "name": "内田　晴彦",
        "dept": "非常勤講師"
    },
    {
        "name": "大谷　壮介",
        "dept": "非常勤講師"
    },
    {
        "name": "大坪　義一",
        "dept": "非常勤講師"
    },
    {
        "name": "小形　美妃",
        "dept": "非常勤講師"
    },
    {
        "name": "越智　敏明",
        "dept": "非常勤講師"
    },
    {
        "name": "垣内　喜代三",
        "dept": "非常勤講師"
    },
    {
        "name": "片山　登揚",
        "dept": "非常勤講師"
    },
    {
        "name": "加藤　のん",
        "dept": "非常勤講師"
    },
    {
        "name": "鎌倉　祥太郎",
        "dept": "非常勤講師"
    },
    {
        "name": "川上　幸三",
        "dept": "非常勤講師"
    },
    {
        "name": "北村　幸定",
        "dept": "非常勤講師"
    },
    {
        "name": "木下　佐和子",
        "dept": "非常勤講師"
    },
    {
        "name": "木村　安佐子",
        "dept": "非常勤講師"
    },
    {
        "name": "京　鴻一",
        "dept": "非常勤講師"
    },
    {
        "name": "楠本　藍梨",
        "dept": "非常勤講師"
    },
    {
        "name": "黒田　良一",
        "dept": "非常勤講師"
    },
    {
        "name": "小出　宏樹",
        "dept": "非常勤講師"
    },
    {
        "name": "小森　勇人",
        "dept": "非常勤講師"
    },
    {
        "name": "相根　心",
        "dept": "非常勤講師"
    },
    {
        "name": "佐藤　亜紀子",
        "dept": "非常勤講師"
    },
    {
        "name": "須﨑　昌已",
        "dept": "非常勤講師"
    },
    {
        "name": "武知　薫子",
        "dept": "非常勤講師"
    },
    {
        "name": "塚本　大智",
        "dept": "非常勤講師"
    },
    {
        "name": "戸塚　譲次郎",
        "dept": "非常勤講師"
    },
    {
        "name": "中井　勝博",
        "dept": "非常勤講師"
    },
    {
        "name": "永田　 實",
        "dept": "非常勤講師"
    },
    {
        "name": "新納　格",
        "dept": "非常勤講師"
    },
    {
        "name": "西村　有理",
        "dept": "非常勤講師"
    },
    {
        "name": "濱崎　雅孝",
        "dept": "非常勤講師"
    },
    {
        "name": "早石　典史",
        "dept": "非常勤講師"
    },
    {
        "name": "平井　三友",
        "dept": "非常勤講師"
    },
    {
        "name": "福山　亮介",
        "dept": "非常勤講師"
    },
    {
        "name": "増木　啓二",
        "dept": "非常勤講師"
    },
    {
        "name": "松永　健聖",
        "dept": "非常勤講師"
    },
    {
        "name": "真野　純司",
        "dept": "非常勤講師"
    },
    {
        "name": "森口　雅弘",
        "dept": "非常勤講師"
    },
    {
        "name": "安田　昌弘",
        "dept": "工学部"
    },
    {
        "name": "野村　俊之",
        "dept": "工学部"
    },
    {
        "name": "山田　伸武",
        "dept": "非常勤講師"
    },
    {
        "name": "吉川　明里",
        "dept": "非常勤講師"
    },
    {
        "name": "葭谷　安正",
        "dept": "非常勤講師"
    },
    {
        "name": "吉本　隆光",
        "dept": "非常勤講師"
    },
    {
        "name": "楼　　娟",
        "dept": "非常勤講師"
    },
    {
        "name": "若竹　昌洋",
        "dept": "非常勤講師"
    },
    {
        "name": "若林　悟",
        "dept": "非常勤講師"
    }
];